bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
    /* State machine */
    switch (garudaData.state)
    {
        case ESC_IDLE:
        case ESC_ARMED:
            break;

#if FEATURE_SINE_STARTUP
        case ESC_ALIGN:
        case ESC_OL_RAMP:
            if (garudaData.sine.active)
            {
                uint32_t dA, dB, dC;
                STARTUP_SineComputeDuties(&garudaData, &dA, &dB, &dC);
                HAL_PWM_SetDutyCycle3Phase(dA, dB, dC);
            }
            break;
#else
        case ESC_ALIGN:
        case ESC_OL_RAMP:
            break;
#endif

#if DIAGNOSTIC_MANUAL_STEP
        case ESC_CLOSED_LOOP:
            /* Manual step mode: ADC ISR just holds duty. No automatic commutation. */
            HAL_PWM_SetDutyCycle(garudaData.duty);
            break;
#elif FEATURE_BEMF_CLOSED_LOOP
        case ESC_CLOSED_LOOP:
        {
            /* Throttle-zero shutdown: if pot returns to zero after being raised,
             * gracefully stop. Don't wait for desync — at low duty the HW ZC
             * comparator can trigger on noise indefinitely, keeping the motor
             * in a stalled-but-"running" state (audible buzz).
             *
             * hasSeenThrottle prevents false shutdown at CL entry — the arming
             * gate requires pot=0, so pot is still at zero when CL starts.
             * Only arm the shutdown after the user has raised the pot once. */
            {
                static bool hasSeenThrottle = false;
                static uint16_t zeroThrottleCount = 0;

                if (prevAdcState != ESC_CLOSED_LOOP)
                {
                    hasSeenThrottle = false;
                    zeroThrottleCount = 0;
                }

                if (garudaData.throttle >= ARM_THROTTLE_ZERO_ADC)
                    hasSeenThrottle = true;

                if (hasSeenThrottle && garudaData.throttle < ARM_THROTTLE_ZERO_ADC)
                {
                    if (++zeroThrottleCount >= (PWMFREQUENCY_HZ / 20))  /* 50ms */
                    {
#if FEATURE_ADC_CMP_ZC
                        if (garudaData.hwzc.enabled)
                            HWZC_Disable(&garudaData);
                        garudaData.hwzc.fallbackPending = false;
#endif
                        HAL_MC1PWMDisableOutputs();
                        garudaData.runCommandActive = false;
                        garudaData.state = ESC_IDLE;
                        LED2 = 0;
                        zeroThrottleCount = 0;
                        break;
                    }
                }
                else
                {
                    zeroThrottleCount = 0;
                }
            }

            /* Detect first entry into CLOSED_LOOP (state transition) */
            if (prevAdcState != ESC_CLOSED_LOOP)
            {
                uint16_t initPeriod = TIMER1_TO_ADC_TICKS(garudaData.rampStepPeriod);
                if (initPeriod < MIN_ADC_STEP_PERIOD)
                    initPeriod = MIN_ADC_STEP_PERIOD;
                if (initPeriod > INITIAL_ADC_STEP_PERIOD)
                    initPeriod = INITIAL_ADC_STEP_PERIOD;
                BEMF_ZC_Init(&garudaData, initPeriod);
                BEMF_ZC_OnCommutation(&garudaData, adcIsrTick);
                garudaData.bemf.ad2SettleCount = ZC_AD2_SETTLE_SAMPLES;
#if FEATURE_ADC_CMP_ZC
                /* Clear stale HWZC state from any prior run */
                garudaData.hwzc.fallbackPending = false;
                garudaData.hwzc.enablePending = false;
                garudaData.hwzc.dbgLatchDisable = false;
#endif
            }

#if FEATURE_ADC_CMP_ZC
            /* HW->SW fallback re-seed (Rule 9) */
            if (garudaData.hwzc.fallbackPending)
            {
                garudaData.hwzc.fallbackPending = false;
                garudaData.hwzc.enablePending = false;
                uint16_t swPeriod = HWZC_SCCP2_TO_ADC(
                    garudaData.hwzc.stepPeriodHR);
                if (swPeriod < MIN_ADC_STEP_PERIOD)
                    swPeriod = MIN_ADC_STEP_PERIOD;
                if (swPeriod > INITIAL_ADC_STEP_PERIOD)
                    swPeriod = INITIAL_ADC_STEP_PERIOD;
                BEMF_ZC_Init(&garudaData, swPeriod);
                BEMF_ZC_OnCommutation(&garudaData, adcIsrTick);
                garudaData.bemf.ad2SettleCount = ZC_AD2_SETTLE_SAMPLES;

                if (garudaData.hwzc.goodZcCount >= ZC_SYNC_THRESHOLD)
                {
                    /* HW ZC had good lock — seed as synced to avoid
                     * pre-sync forced-commutation jerk at transition */
                    garudaData.timing.zcSynced = true;
                    garudaData.timing.goodZcCount = ZC_SYNC_THRESHOLD;
                    garudaData.timing.forcedCountdown =
                        swPeriod * ZC_TIMEOUT_MULT;
                }
                else
                {
                    /* HW ZC was struggling — conservative pre-sync */
                    garudaData.timing.zcSynced = false;
                    garudaData.timing.forcedCountdown = swPeriod;
                }
            }

            if (!garudaData.hwzc.enabled)
            {
#endif /* FEATURE_ADC_CMP_ZC */

            if (!garudaData.timing.zcSynced)
            {
                /* === PRE-SYNC: Forced commutation + passive ZC detection === */

                if (garudaData.timing.forcedCountdown > 0)
                    garudaData.timing.forcedCountdown--;

                if (garudaData.timing.forcedCountdown == 0)
                {
                    COMMUTATION_AdvanceStep(&garudaData);
                    BEMF_ZC_OnCommutation(&garudaData, adcIsrTick);
                    garudaData.timing.forcedCountdown = garudaData.timing.stepPeriod;
                    garudaData.zcDiag.forcedStepPresyncCount++;
                }

                /* Passive ZC detection (builds goodZcCount, no commutation trigger) */
                BEMF_ZC_Poll(&garudaData, adcIsrTick);

                if (garudaData.timing.stepsSinceLastZc > ZC_STALENESS_LIMIT)
                    garudaData.timing.goodZcCount = 0;

