bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
                    if (garudaData.timing.goodZcCount == 0)
                    {
                        garudaData.timing.zcSynced = false;
                        garudaData.timing.hasPrevZc = false;
                        uint16_t initPeriod = TIMER1_TO_ADC_TICKS(garudaData.rampStepPeriod);
                        if (initPeriod < MIN_ADC_STEP_PERIOD)
                            initPeriod = MIN_ADC_STEP_PERIOD;
                        garudaData.timing.stepPeriod = initPeriod;
                        garudaData.timing.forcedCountdown = initPeriod;
                    }
                }
            }

#if FEATURE_ADC_CMP_ZC
            }
            else
            {
                /* hwzc.enabled=true: software ZC block skipped.
                 * SCCP1 ISR + comparator ISR handle commutation. */

                /* No speed-drop fallback: once HW ZC activates, it stays
                 * active at all speeds. The ADC comparator works fine at low
                 * eRPM (24kHz samples → plenty per step). Only miss-limit
                 * triggers fallback (error condition). This eliminates the
                 * HW→SW transition jerk during normal deceleration. */

#if FEATURE_BEMF_INTEGRATION
                /* Read-only observer: keep shadow integration warm (Rule 11) */
                {
                    bool newComm = (garudaData.hwzc.commSeq
                                    != garudaData.hwzc.obsCommSeq);
                    if (newComm)
                    {
                        garudaData.hwzc.obsCommSeq =
                            garudaData.hwzc.commSeq;
                        garudaData.hwzc.obsLastCommTick = adcIsrTick;
                        /* Seqlock read of stepPeriodHR (Rule 13) */
                        uint32_t sp;
                        uint16_t s1, s2;
                        do {
                            s1 = garudaData.hwzc.writeSeq;
                            sp = garudaData.hwzc.stepPeriodHR;
                            s2 = garudaData.hwzc.writeSeq;
                        } while (s1 != s2 || (s1 & 1));
                        uint16_t obsPeriod = HWZC_SCCP2_TO_ADC(sp);
                        if (obsPeriod < 1) obsPeriod = 1;
                        BEMF_INTEG_ObserverOnComm(&garudaData, obsPeriod);
                        garudaData.hwzc.shadowHwzcSkipCount++;
                    }
                    BEMF_INTEG_ObserverTick(&garudaData, adcIsrTick,
                        garudaData.hwzc.obsLastCommTick);
                }
#endif /* FEATURE_BEMF_INTEGRATION */
            }
#endif /* FEATURE_ADC_CMP_ZC */

#if FEATURE_ADC_CMP_ZC
        cl_duty_control:
#endif

            /* Duty cycle control. */
            {
                uint32_t cap = garudaData.timing.zcSynced ? MAX_DUTY : RAMP_DUTY_CAP;
                uint32_t mappedDuty;

#if FEATURE_DUTY_SLEW
                static uint16_t postSyncCounter = 0;
#endif

                if (!garudaData.timing.zcSynced)
                {
                    /* Pre-sync: hold duty at CL entry level.
                     * Don't let pot changes affect duty while forced
                     * commutation is trying to lock ZC — changing duty
                     * shifts the threshold and confuses detection. */
                    mappedDuty = garudaData.duty;
#if FEATURE_DUTY_SLEW
                    postSyncCounter = 0;
#endif
                }
                else
                {
#if FEATURE_DUTY_SLEW
                    if (postSyncCounter < POST_SYNC_SETTLE_TICKS)
                        postSyncCounter++;
#endif
                    mappedDuty = MIN_DUTY +
                        ((uint32_t)garudaData.potRaw * (cap - MIN_DUTY)) / 4096;
                }
                if (mappedDuty < MIN_DUTY) mappedDuty = MIN_DUTY;
                if (mappedDuty > cap) mappedDuty = cap;

#if FEATURE_DUTY_SLEW
                {
                    static uint32_t prevDuty = 0;
                    if (prevAdcState != ESC_CLOSED_LOOP)
                        prevDuty = garudaData.duty;

                    /* Post-sync settle: use reduced slew-up rate for
                     * POST_SYNC_SETTLE_MS after ZC lock. This prevents
                     * the motor from accelerating faster than the
                     * stepPeriod IIR can track on low-inertia motors.
                     * Normal rate: 2%/ms. Settle rate: 0.25%/ms (1/8). */
                    uint32_t upRate = DUTY_SLEW_UP_RATE;
                    if (postSyncCounter < POST_SYNC_SETTLE_TICKS)
                        upRate = DUTY_SLEW_UP_RATE / POST_SYNC_SLEW_DIVISOR;

                    int32_t delta = (int32_t)mappedDuty - (int32_t)prevDuty;
                    if (delta > 0)
                    {
                        if ((uint32_t)delta > upRate)
                            mappedDuty = prevDuty + upRate;
                    }
                    else if (delta < 0)
                    {
                        if ((uint32_t)(-delta) > DUTY_SLEW_DOWN_RATE)
                            mappedDuty = prevDuty - DUTY_SLEW_DOWN_RATE;
                    }
                    prevDuty = mappedDuty;
                }
#endif
                if (garudaData.timing.stepPeriod <= MIN_CL_ADC_STEP_PERIOD
                    && mappedDuty > garudaData.duty)
                {
                    mappedDuty = garudaData.duty;
                }

#if FEATURE_VBUS_SAG_LIMIT
                {
                    static uint16_t vbusFiltered = 0;
                    static bool vbusSagActive = false;

                    if (prevAdcState != ESC_CLOSED_LOOP)
                    {
                        vbusFiltered = garudaData.vbusRaw;
                        vbusSagActive = false;
                    }

                    vbusFiltered = (uint16_t)(
                        ((uint32_t)vbusFiltered * 7 + garudaData.vbusRaw) >> 3);

                    if (!vbusSagActive && vbusFiltered < VBUS_SAG_THRESHOLD_ADC)
                        vbusSagActive = true;
                    else if (vbusSagActive && vbusFiltered > VBUS_SAG_RECOVERY_ADC)
                        vbusSagActive = false;

                    if (vbusSagActive)
                    {
                        uint32_t sagDepth = (vbusFiltered < VBUS_SAG_THRESHOLD_ADC) ?
                            (VBUS_SAG_THRESHOLD_ADC - vbusFiltered) : 0;
                        uint32_t reduction = (sagDepth * VBUS_SAG_GAIN) >> 4;
                        if (reduction >= mappedDuty)
                            mappedDuty = MIN_DUTY;
                        else
                            mappedDuty -= reduction;
                    }

