bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
                    if (mappedDuty < MIN_DUTY)
                        mappedDuty = MIN_DUTY;
                }
#endif

                garudaData.duty = mappedDuty;
            }
            HAL_PWM_SetDutyCycle(garudaData.duty);
            break;
        }
#else  /* !FEATURE_BEMF_CLOSED_LOOP — Phase 1 open-loop path */
        case ESC_CLOSED_LOOP:
            HAL_PWM_SetDutyCycle(garudaData.duty);
            break;
#endif

        case ESC_BRAKING:
            break;

        case ESC_RECOVERY:
            /* PWM already disabled on entry — coast-down handled in Timer1 */
            break;

        case ESC_FAULT:
            HAL_MC1PWMDisableOutputs();
            break;
    }

#if FEATURE_BEMF_CLOSED_LOOP
    /* Track state for transition detection (must be last before flag clear) */
    prevAdcState = garudaData.state;
#endif

    /* Clear interrupt flag AFTER reading all buffers (matches reference) */
    GARUDA_ClearADCIF();
}

/**
 * @brief Timer1 ISR — 100us tick.
 * Handles: heartbeat LED, board service, commutation timing for
 * align/ramp states, 1ms system tick.
 */
void __attribute__((__interrupt__, no_auto_psv)) _T1Interrupt(void)
{
    /* Heartbeat LED — toggle at ~2Hz (250ms) */
    heartbeatCounter++;
    if (heartbeatCounter >= HEART_BEAT_LED_COUNT)
    {
        heartbeatCounter = 0;
        if (LED1 == 1)
            LED1 = 0;
        else
            LED1 = 1;
    }

    /* Board service step (drives button debounce at 1ms) */
    BoardServiceStepIsr();

    /* 1ms system tick sub-counter (10 x 100us = 1ms) */
    msSubCounter++;
    if (msSubCounter >= 10)
    {
        msSubCounter = 0;
        garudaData.systemTick++;
    }

    /* State-specific processing at 100us rate */
    switch (garudaData.state)
    {
        case ESC_IDLE:
            /* Nothing — waiting for button press in main loop */
            break;

        case ESC_ARMED:
            /* Verify throttle stays at zero for ARM_TIME */
            if (garudaData.throttle < ARM_THROTTLE_ZERO_ADC)
            {
                garudaData.armCounter++;
                if (garudaData.armCounter >= ARM_TIME_COUNTS)
                {
                    /* Armed successfully — transition to ALIGN */
                    garudaData.state = ESC_ALIGN;
                    STARTUP_Init(&garudaData);
                    LED2 = 1; /* Motor running indicator */
                }
            }
            else
            {
                garudaData.armCounter = 0; /* Reset if throttle not zero */
            }
            break;

        case ESC_ALIGN:
#if FEATURE_SINE_STARTUP
            if (STARTUP_SineAlign(&garudaData))
                garudaData.state = ESC_OL_RAMP;
#else
            if (STARTUP_Align(&garudaData))
            {
                garudaData.state = ESC_OL_RAMP;
                garudaData.rampCounter = garudaData.rampStepPeriod;
            }
#endif
            break;

#if DIAGNOSTIC_MANUAL_STEP
        case ESC_OL_RAMP:
            garudaData.state = ESC_CLOSED_LOOP;
            break;
#elif FEATURE_SINE_STARTUP
        case ESC_OL_RAMP:
        {
            static uint8_t sineCoastCount = 0;

            if (sineCoastCount > 0)
            {
                /* Coast gap: motor coasts on inertia while winding
                 * currents decay. All phases at center duty = zero
                 * net voltage. After L/R decay, transition to trap. */
                sineCoastCount--;
                if (sineCoastCount == 0)
                {
                    /* Coast complete — transition to trap */
                    uint8_t step = STARTUP_SineGetTransitionStep(&garudaData);
                    COMMUTATION_ApplyStep(&garudaData, step);

                    garudaData.duty = garudaData.sine.amplitude;
                    if (garudaData.duty < MIN_DUTY)
                        garudaData.duty = MIN_DUTY;
                    if (garudaData.duty > RAMP_DUTY_CAP)
                        garudaData.duty = RAMP_DUTY_CAP;
                    HAL_PWM_SetDutyCycle(garudaData.duty);

                    garudaData.rampStepPeriod = MIN_STEP_PERIOD;
                    garudaData.state = ESC_CLOSED_LOOP;
                }
                break;
            }

            if (STARTUP_SineRamp(&garudaData))
            {
                /* Target speed reached — begin coast gap.
                 * De-energize all phases (center duty = zero net voltage).
                 * Motor coasts on inertia while winding currents decay
                 * through the L/R time constant (~1.14ms for Hurst).
                 * Eliminates current discontinuity at sine->trap transition. */
                garudaData.sine.active = false;
                HAL_PWM_SetDutyCycle3Phase(SINE_CENTER_DUTY,
                                           SINE_CENTER_DUTY,
                                           SINE_CENTER_DUTY);

                /* Pre-advance sine angle to account for rotor movement
                 * during coast. Motor continues at ~RAMP_TARGET_ERPM
                 * under inertia. Without this, the step mapping would
                 * be wrong by coast_time * eRPM degrees. */
                uint32_t coastAngle = ((uint32_t)garudaData.sine.angleIncrement
                    * SINE_COAST_GAP_TICKS * PWMFREQUENCY_HZ) / 10000;
                garudaData.sine.angle += (uint16_t)coastAngle;

                sineCoastCount = SINE_COAST_GAP_TICKS;
            }
            break;
        }
#else
        case ESC_OL_RAMP:
            if (STARTUP_OpenLoopRamp(&garudaData))
            {
                garudaData.state = ESC_CLOSED_LOOP;
            }
            break;
#endif

#if DIAGNOSTIC_MANUAL_STEP
        case ESC_CLOSED_LOOP:
            /* Manual step mode: hold current step. SW2 advances from main loop. */
            break;
#elif FEATURE_BEMF_CLOSED_LOOP
        case ESC_CLOSED_LOOP:
            /* Phase 2: All commutation handled in ADC ISR. Timer1 does nothing. */
            break;
#else
        case ESC_CLOSED_LOOP:
            /* Phase 1: keep forced commutation at final ramp speed. */
            if (garudaData.rampCounter > 0)
            {
                garudaData.rampCounter--;
            }
            if (garudaData.rampCounter == 0)
            {
                COMMUTATION_AdvanceStep(&garudaData);
                garudaData.rampCounter = garudaData.rampStepPeriod;
            }
            break;
#endif

        case ESC_BRAKING:
            break;

        case ESC_RECOVERY:
#if FEATURE_DESYNC_RECOVERY
            if (garudaData.recoveryCounter > 0)
            {
                garudaData.recoveryCounter--;
            }
            else
            {
                if (garudaData.runCommandActive &&
                    garudaData.desyncRestartAttempts < DESYNC_MAX_RESTARTS &&
                    garudaData.throttle >= ARM_THROTTLE_ZERO_ADC)
                {
                    garudaData.desyncRestartAttempts++;
                    garudaData.state = ESC_ALIGN;
                    STARTUP_Init(&garudaData);
                    LED2 = 1;
                }
                else if (garudaData.throttle < ARM_THROTTLE_ZERO_ADC)
                {
                    /* Throttle is zero — user wants motor stopped.
                     * Don't restart, go to IDLE. */
                    garudaData.runCommandActive = false;
                    garudaData.desyncRestartAttempts = 0;
                    garudaData.state = ESC_IDLE;
                    LED2 = 0;
                }
                else if (!garudaData.runCommandActive)
                {
                    /* User pressed stop during coast — graceful idle */
                    garudaData.desyncRestartAttempts = 0;
                    garudaData.state = ESC_IDLE;
                    LED2 = 0;
                }
                else
                {
                    /* Max restarts exhausted — permanent fault */
                    garudaData.runCommandActive = false;
                    garudaData.state = ESC_FAULT;
                    garudaData.faultCode = FAULT_DESYNC;
                    LED2 = 0;
                }
            }
#endif
            break;

        case ESC_FAULT:
            break;
    }

    TIMER1_InterruptFlagClear();
}

/**
 * @brief PWM Fault ISR — handles PCI fault events.
 */
void __attribute__((__interrupt__, no_auto_psv)) _PWMInterrupt(void)
{
    if (PCI_FAULT_ACTIVE_STATUS)
    {
        /* Fault detected — disable outputs and set fault state */
#if FEATURE_ADC_CMP_ZC
        if (garudaData.hwzc.enabled)
            HWZC_Disable(&garudaData);
#endif
        HAL_MC1ClearPWMPCIFault();
        HAL_MC1PWMDisableOutputs();
        garudaData.state = ESC_FAULT;
        garudaData.faultCode = FAULT_OVERCURRENT;
        garudaData.runCommandActive = false;
#if FEATURE_ADC_CMP_ZC
        garudaData.hwzc.fallbackPending = false;
#endif
        LED2 = 0;
    }
    ClearPWMIF();
}

#if FEATURE_ADC_CMP_ZC
/**
 * @brief ADC1 Comparator CH5 ISR — ZC detected on Phase B.
 * Do NOT re-read AD1CH5DATA for validation (Rule 10).
 */
void __attribute__((__interrupt__, no_auto_psv)) _AD1CMP5Interrupt(void)
{
    _AD1CMP5IE = 0;              /* Disable immediately to prevent re-trigger */
    AD1CMPSTATbits.CH5CMP = 0;  /* Clear comparator status */
    if (garudaData.hwzc.enabled)
        HWZC_OnZcDetected(&garudaData);
    _AD1CMP5IF = 0;
}

/**
 * @brief ADC2 Comparator CH1 ISR — ZC detected on Phase A or C.
 */
void __attribute__((__interrupt__, no_auto_psv)) _AD2CMP1Interrupt(void)
{
    _AD2CMP1IE = 0;
    AD2CMPSTATbits.CH1CMP = 0;
    if (garudaData.hwzc.enabled)
        HWZC_OnZcDetected(&garudaData);
    _AD2CMP1IF = 0;
}

/**
 * @brief SCCP1 Timer ISR — blanking expired, commutation deadline, or timeout.
 * Action determined by hwzc.phase (Rule 3: phase is set BEFORE timer starts).
 */
void __attribute__((__interrupt__, no_auto_psv)) _CCT1Interrupt(void)
{
    if (!garudaData.hwzc.enabled)
    {
        /* HWZC was disabled (fault, button stop, throttle-zero shutdown)
         * while a timer event was pending. Discard — do not commutate. */
        _CCT1IF = 0;
        return;
    }

    switch (garudaData.hwzc.phase)
    {
        case HWZC_BLANKING:
            HWZC_OnBlankingExpired(&garudaData);
            break;
        case HWZC_WATCHING:
            HWZC_OnTimeout(&garudaData);
            break;
        case HWZC_COMM_PENDING:
            HWZC_OnCommDeadline(&garudaData);
            break;
        default:
            break;
    }
    _CCT1IF = 0;
}
#endif /* FEATURE_ADC_CMP_ZC */
